Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/local_and_regional_government/councillors.html.txt.tmx
Source language: en
Languages: ga

source: The members of each local authority are all called 'councillors'
ga: 'Comhairleoirí' a thugtar ar chomhaltaí gach údaráis áitiúil

source: (For example, county councillor, city councillor as appropriate)
ga: (Mar shampla, comhairleoir contae, comhairleoir cathrach, mar is cuí)

source: The number of members of each local authority is fixed by law
ga: Le reachtaíocht a shocraítear líon na gcomhaltaí ar gach údarás áitiúil

source: This means that Schedule 7 of the Local Government Act, 2001, as amended by Section 15 of the Local Government Reform Act 2014, has set down the number of members of every county council, city council and city and county council throughout the country
ga: Sé sin le rá go bhfuil líon na gcomhaltaí ar gach comhairle socraithe de réir Sceideal a 7 den Acht um Rialtas Áitiúil 2001 arna leasú ag Alt 15 den Acht um Athchóiriú an Rialtais Áitiúil 2014

source: Councillors are directly elected in local elections by members of the local community
ga: An pobal áitiúil a thoghann na comhaltaí díreach glan i dtoghcháin áitiúla

source: The number of councillors elected to each local authority depends on the population of the local authority area
ga: Braitheann líon na gcomhairleoirí ar gach údarás áitiúil ar an daonra i gceantar an údaráis áitiúil

source: Elected members come into office seven days after polling day
ga: Téann na comhaltaí i mbun a gcuid dualgas seacht lá tar éis lá na dtoghchán

source: Each member holds office for five years, that is until seven days after the polling day at the next local elections – which are by law held in the month of May or June on a day fixed by the Minister for Housing, Planning, Community and Local Government
ga: Cúig bliana a chaitheann gach comhalta in oifig, sé sin go ceann seacht lá tar éis na dtoghchán áitiúil dar gcionn - a bhíonn ann de réir dlí i mí Bealtaine nó Meitheamh ar lá a shocraíonn an tAire Tithíochta, Pleanála, Pobal is Rialtais Áitiúil

source: Each elected member is expected to regularly attend meetings of the full council and the local authority committees of which they are members, although it may occasionally be the case that members may not be able to fulfil their obligations, for example, due to ill-health
ga: Bítear ag súil leis go mbeidh gach comhalta tofa i láthair go rialta ag ollchruinnithe na comhairle agus na gcoistí rialtais áitiúil a bhfuil siad ina mbaill díobh, ach glactar leis go bhféadfadh sé tarlú nach mbeadh comhalta in ann a gcuid dualgas a chomhlíonadh de bharr tinnis, mar shampla

source: A councillor may resign by delivering a notice in writing
ga: Féadfaidh comhairleoir éirí as ach fógra scríofa a thabhairt

source: They are deemed to have resigned if he or she does not attend a council meeting for 6 consecutive months (unless he or she was ill or there was some other good reason)
ga: Glactar leis go bhfuil sé éirithe as mura mbíonn sé i láthair ag cruinniú den chomhairle ar feadh sé mhí as a chéile (ach amháin i gcás tinnis nó ar údar maith eile)

source: However, before the expiry of this period a local authority may by resolution grant an extension for a further six months where the absence is due to illness or occurs in good faith due to other reasons
ga: Ach sula mbíonn na sé mhí istigh d'fhéadfadh údarás áitiúil glacadh le rún ag ceadú sé mhí breise i gcás tinnis nó ar údar maith eile

source: Only one further subsequent such extension may be granted, subject to a maximum period of eighteen months continuous absence
ga: Níl ach tréimhse amháin eile den chineál sin ceadaithe, gan níos mó ná ocht mí dhéag de neamhláithreacht leantach

source: If a councillor dies, resigns or becomes disqualified from being a member of the council, the vacancy is filled by co-option
ga: Má fhaigheann comhairleoir bás, nó má éiríonn sé as, nó má dhícháiltear é mar chomhairleoir, líontar an folúntas trí "chomhthoghadh"

source: The political party who originally nominated the member who caused the vacancy nominates a new member and the council then passes a resolution to appoint the new member
ga: An páirtí polaitíochta a chéad-ainmnigh an té faoi deara an fholúntais, is iad a ainmníonn an comhalta nua agus ansin ritheann an chomhairle rún á cheapadh

source: Councillors may not be members of more than one local authority
ga: Níl cead ag comhairleoirí bheith ina gcomhaltaí ar níos mó ná aon údaráis áitiúil amháin

source: Ethics and codes of conduct
ga: Eitic agus cóid iompair

source: In January 2003 an ethics framework came into operation governing the ethics and codes of conduct of local authority members
ga: In Eanáir na bliana 2003 cuireadh creatlach nua eitice i bhfeidhm le heitic agus cóid iompair comhaltaí na n-údarás áitiúil a rialú

source: As a general rule, this framework provides that it is the duty of every local authority member and employee to maintain proper standards of integrity, conduct and concern for the public interest
ga: I gcoitinne, leagtar síos sa chreatlach go bhfuil sé de dhualgas ar gach comhalta agus fostaí d'údarás áitiúil caighdeáin chearta ionracais agus iompair a chleachtadh agus leas an phobail a dhéanamh le dúthracht

source: In addition, it established for each member a system of annual declaration of interests, disclosure of interest in a matter which comes before the authority and a public register of interests
ga: Chomh maith leis sin, ordaítear do gach comhalta dearbhú bliantúil a dhéanamh ar fhoinsí a leasa, aon bhuntáiste a d'fhéadfadh sé a bhaint as beartais an údaráis a fhógairt agus foinsí a leasa a liostáil i gclárleabhar poiblí

source: The interests which have to be declared annually are set out in Section 175 of the 2001 Act and associated regulations
ga: Tá na foinsí leasa ba chóir a fhógairt go bliantúil liostáilte i Mír 175 de Acht na bliana 2001 agus i rialacháin ghaolmhara

source: (As a general guide, they include such as holdings of land or other property, shareholdings, directorships, contracts with a local authority
ga: (I gcoitinne, is éard tá i gceist ná úinéireacht talún nó maoine, scairshealbhóireachtaí, stiúrthóireachtaí, conarthaí le húdarás áitiúil

source: Each member must complete and return each year a form setting out his or her interests)
ga: Bíonn ar gach comhalta foirm a líonadh gach bliain ag liostáil foinsí a leasa agus í a sheoladh ar ais ag an údarás)

source: There is a financial support framework for councillors which involves:
ga: Le blianta beaga anuas tá creatlach tacaíocht airgeadais do chomhairleoirí a leagann amach:

source: • Representational payment (i.e., a salary-type payment)
ga: • Íocaíocht comhalta (.i. iocaíocht de chineál tuarastail)

source: • Fixed annual allowance (towards meetings and other expenses)
ga: • Liúntas bliantúil (chun íoc as freastal ar chruinnithe agus costais eile)

source: • Ad-hoc expenses (i.e., conferences and other events)
ga: • Costais ad hoc (.i. freastal ar chomhdhálacha agus imeachtaí eile)

source: • Retirement gratuity (i.e., lump sum on retirement)
ga: • Airgead Scoir (.i. cnapshuim scoir)

source: The cathaoirleach of the council and the chairperson of one of the local authority committees (the special policy committee) also get an additional allowance
ga: Faigheann cathaoirleach na comhairle agus cathaoirleach ceann de choistí an údaráis áitiúil (an Coiste Beartas Speisialta) liúntas breise

source: In order to become a member of a local authority, you must be elected by the people in your local area
ga: Le bheith i do chomhalta ar údarás ní mór go dtoghfaidh muintir na háite thú

source: Before you are elected, you must be nominated for election
ga: Roimhe sin ní mór go n-ainmneofaí thú don toghchán

source: You can find out more in our document on nomination of candidates for local elections
ga: Tá tuilleadh eolais faoi ainmniú iarrthóirí do thoghcháin áitiúla anseo

source: Further information regarding membership of, and contact information for members of your local authority is available directly from your local authority
ga: Tá tuilleadh eolais faoi bhallraíocht agus sonraí teagmhála de bhall d'údarás áitiúil ar fáil go díreach ó d'údarás áitiúil
